# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [8]:
s1=pd.Series(np.random.randint(1,5,100))
s2=pd.Series(np.random.randint(1,4,100))
s3=pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [14]:
df=pd.concat([s1,s2,s3],axis=1)
df.head()

   0  1      2
0  4  2  12635
1  4  1  26734
2  1  1  15673
3  4  3  10874
4  2  1  14955

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
df.columns=['bedrs','bathrs','price_sqr_meter']
df

# df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)

    bedrs  bathrs  price_sqr_meter
0       4       2            12635
1       4       1            26734
2       1       1            15673
3       4       3            10874
4       2       1            14955
..    ...     ...              ...
95      3       3            18873
96      4       3            12988
97      1       1            16728
98      1       2            17188
99      1       3            19036

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
bigcolumn=pd.concat([s1,s2,s3],axis=0)
# bigcolumn=pd.DataFrame(bigcolumn)
bigcolumn=bigcolumn.to_frame()
# bigcolumn.__class__
bigcolumn

        0
0       4
1       4
2       1
3       4
4       2
..    ...
95  18873
96  12988
97  16728
98  17188
99  19036

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [24]:
len(bigcolumn) #有300 个呢  保留了索引而已 3个 0-99

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [32]:
#这样会重写索引，原先还有,且bigcolumn并不会改变，只是调用此函数会显示索引
# bigcolumn.reset_index()

#这样可以删掉索引列，并替换
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        4
1        4
2        1
3        4
4        2
..     ...
295  18873
296  12988
297  16728
298  17188
299  19036

[300 rows x 1 columns]